In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":["harry","rohan","skiff","subh"],
    "marks":[92,43,24,17],
    "city":["rmapur","kolkata","bareilly","pokhara"]
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

    name  marks      city
0  harry     92    rmapur
1  rohan     43   kolkata
2  skiff     24  bareilly
3   subh     17   pokhara

In [ ]:
df